package ai.kitt.snowboy.util;

public class Utils {
    private static final String[] specialChar = new String[]{
            "Á", "À", "Ả", "Ã", "Ạ", "á", "à", "ả", "ã", "ạ",
            "Ă", "Ắ", "Ằ", "Ẳ", "Ẵ", "Ặ", "ă", "ắ", "ằ", "ẳ", "ẵ", "ặ",
            "Â", "Ấ", "Ầ", "Ẩ", "Ẫ", "Ậ", "â", "ấ", "ầ", "ẩ", "ẫ", "ậ",
            "Đ", "đ",
            "É", "È", "Ẻ", "Ẽ", "Ẹ", "é", "è", "ẻ", "ẽ", "ẹ",
            "Ê", "Ế", "Ề", "Ể", "Ễ", "Ệ", "ê", "ế", "ề", "ể", "ễ", "ệ",
            "Ó", "Ò", "Ỏ", "Õ", "Ọ", "ó", "ò", "ỏ", "õ", "ọ",
            "Ô", "Ố", "Ồ", "Ổ", "Ỗ", "Ộ", "ô", "ố", "ồ", "ổ", "ỗ", "ộ",
            "Ơ", "Ớ", "Ờ", "Ở", "Ỡ", "Ợ", "ơ", "ớ", "ờ", "ở", "ỡ", "ợ",
            "Ú", "Ù", "Ủ", "Ũ", "Ụ", "ú", "ù", "ủ", "ũ", "ụ",
            "Ư", "Ứ", "Ừ", "Ử", "Ữ", "Ự", "ư", "ứ", "ừ", "ử", "ữ", "ự",
            "I", "Í", "Ì", "Ỉ", "Ĩ", "Ị", "i", "í", "ì", "ỉ", "ĩ", "ị",
            "Ý", "Ỳ", "Ỷ", "Ỹ", "Ỵ", "ý", "ỳ", "ỷ", "ỹ", "ỹ"};

    private static final String[] normalChar = new String[]{
            "A", "A", "A", "A", "A", "a", "a", "a", "a", "a",
            "A", "A", "A", "A", "A", "A", "a", "a", "a", "a", "a", "a",
            "A", "A", "A", "A", "A", "A", "a", "a", "a", "a", "a", "a",
            "D", "d",
            "E", "E", "E", "E", "E", "e", "e", "e", "e", "e",
            "E", "E", "E", "E", "E", "E", "e", "e", "e", "e", "e", "e",
            "O", "O", "O", "O", "O", "o", "o", "o", "o", "o",
            "O", "O", "O", "O", "O", "O", "o", "o", "o", "o", "o", "o",
            "O", "O", "O", "O", "O", "O", "o", "o", "o", "o", "o", "o",
            "U", "U", "U", "U", "U", "u", "u", "u", "u", "u",
            "U", "U", "U", "U", "U", "U", "u", "u", "u", "u", "u", "u",
            "I", "I", "I", "I", "I", "I", "i", "i", "i", "i", "i", "i",
            "Y", "Y", "Y", "Y", "Y", "y", "y", "y", "y", "y"};

    public static String formatString(String input) {
        if (input == null) {
            return null;
        }
        for (int i = 0; i < specialChar.length; i++) {
            input = input.replace(specialChar[i], normalChar[i]);
        }
        return input;
    }
}
